zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_exti.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_exti.c
  * @author  MCD Application Team
  * @brief   EXTI HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the General Purpose Input/Output (EXTI) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                    ##### EXTI Peripheral features #####
  ==============================================================================
  [..]
    (+) Each Exti line can be configured within this driver.

    (+) Exti line can be configured in 3 different modes
        (++) Interrupt
        (++) Event
        (++) Both of them

    (+) Configurable Exti lines can be configured with 3 different triggers
        (++) Rising
        (++) Falling
        (++) Both of them

    (+) When set in interrupt mode, configurable Exti lines have two diffenrents
        interrupt pending registers which allow to distinguish which transition
        occurs:
        (++) Rising edge pending interrupt
        (++) Falling

    (+) Exti lines 0 to 15 are linked to gpio pin number 0 to 15. Gpio port can
        be selected through multiplexer.

                     ##### How to use this driver #####
  ==============================================================================
  [..]

    (#) Configure the EXTI line using HAL_EXTI_SetConfigLine().
        (++) Choose the interrupt line number by setting "Line" member from
             EXTI_ConfigTypeDef structure.
        (++) Configure the interrupt and/or event mode using "Mode" member from
             EXTI_ConfigTypeDef structure.
        (++) For configurable lines, configure rising and/or falling trigger
             "Trigger" member from EXTI_ConfigTypeDef structure.
        (++) For Exti lines linked to gpio, choose gpio port using "GPIOSel"
             member from GPIO_InitTypeDef structure.

    (#) Get current Exti configuration of a dedicated line using
        HAL_EXTI_GetConfigLine().
        (++) Provide exiting handle as parameter.
        (++) Provide pointer on EXTI_ConfigTypeDef structure as second parameter.

    (#) Clear Exti configuration of a dedicated line using HAL_EXTI_GetConfigLine().
        (++) Provide exiting handle as parameter.

    (#) Register callback to treat Exti interrupts using HAL_EXTI_RegisterCallback().
        (++) Provide exiting handle as first parameter.
        (++) Provide which callback will be registered using one value from
             EXTI_CallbackIDTypeDef.
        (++) Provide callback function pointer.

    (#) Get interrupt pending bit using HAL_EXTI_GetPending().

    (#) Clear interrupt pending bit using HAL_EXTI_GetPending().

    (#) Generate software interrupt using HAL_EXTI_GenerateSWI().

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal.h"


/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @addtogroup EXTI
  * @{
  */

#ifdef HAL_EXTI_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private defines ------------------------------------------------------------*/
/** @addtogroup EXTI_Private_Constants EXTI Private Constants
  * @{
  */

/* to use legacy connector */
/*#define HAL_EXTI_USE_CONNECTOR*/

#define EXTI_MODE_OFFSET                  0x04U  /* 0x10=4*4: offset between IMR#i IMR#(i+1) registers */
#define EXTI_CONFIG_OFFSET                0x08U  /* 0x20=4*8: offset between (R/F)TSR#i and (R/F)TSR#(i+1) registers */
#define EXTI_LINE_CID_CFG_ADD_OFFSET      0x01U
#define CPU_CONNECTOR_CID_CFG_ADD_OFFSET  0x01U
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private functions prototype -----------------------------------------------*/
#if defined (CORE_CA35) || defined (CORE_CM33)
uint32_t  EXTI_Exti1_GetImr1();
uint32_t  EXTI_Exti1_GetImr2();
uint32_t  EXTI_Exti1_GetImr3();
uint32_t  EXTI_Exti1_GetEmr3();
void      EXTI_Exti1_SetEmr3(uint32_t u32Value);
void      EXTI_Exti1_SetImr1(uint32_t u32Value);
void      EXTI_Exti1_SetImr2(uint32_t u32Value);
void      EXTI_Exti1_SetImr3(uint32_t u32Value);
void      EXTI_Exti1_SetImr(uint32_t u32Offset, uint32_t u32Value);
uint32_t  EXTI_Exti1_GetImr(uint32_t u32Offset);
void      EXTI_Exti1_SetEmr(uint32_t u32Offset, uint32_t u32Value);
uint32_t  EXTI_Exti1_GetEmr(uint32_t u32Offset);
uint32_t  EXTI_Exti1_GetEmr1(void);
void      EXTI_Exti1_SetEmr1(uint32_t u32Value);
uint32_t  EXTI_Exti1_CheckImr(uint32_t u32Offset);
uint32_t  EXTI_Exti2_CheckEmr(uint32_t u32Offset);
uint32_t  EXTI_Exti1_GetRtsr(uint32_t u32Offset);
uint32_t  EXTI_Exti2_GetRtsr(uint32_t u32Offset);
uint32_t  EXTI_Exti1_GetFtsr(uint32_t u32Offset);
uint32_t  EXTI_Exti2_GetFtsr(uint32_t u32Offset);
uint32_t  EXTI_Exti1_CheckEmr(uint32_t u32Offset);
#endif  /* CORE_CA35 | CORE_CM33 */

uint32_t  EXTI_Exti2_GetImr1();
uint32_t  EXTI_Exti2_GetImr2();
uint32_t  EXTI_Exti2_GetImr3();
uint32_t  EXTI_Exti2_GetEmr1();
uint32_t  EXTI_Exti2_GetEmr2();
void      EXTI_Exti2_SetImr1(uint32_t u32Value);
void      EXTI_Exti2_SetImr2(uint32_t u32Value);
void      EXTI_Exti2_SetImr3(uint32_t u32Value);
void      EXTI_Exti2_SetEmr1(uint32_t u32Value);
void      EXTI_Exti2_SetEmr2(uint32_t u32Value);
void      EXTI_Exti2_SetEmr(uint32_t u32Offset, uint32_t u32Value);
void      EXTI_Exti2_SetImr(uint32_t u32Offset, uint32_t u32Value);
uint32_t  EXTI_Exti2_GetEmr(uint32_t u32Offset);
uint32_t  EXTI_Exti2_GetImr(uint32_t u32Offset);

