zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_exti.c
void      EXTI_SetImr(const EXTI_TypeDef *Instance, uint32_t u32Offset, uint32_t u32Value);
uint32_t  EXTI_GetImr(const EXTI_TypeDef *Instance, uint32_t u32Offset);
void      EXTI_SetEmr(const EXTI_TypeDef *Instance, uint32_t u32Offset, uint32_t u32Value);
uint32_t  EXTI_GetEmr(const EXTI_TypeDef *Instance, uint32_t u32Offset);
uint32_t  EXTI_CheckEmr(const EXTI_TypeDef *Instance, uint32_t u32Offset);

uint32_t  EXTI_GetRtsr(const EXTI_TypeDef *Instance, uint32_t u32Offset);
uint32_t  EXTI_GetFtsr(const EXTI_TypeDef *Instance, uint32_t u32Offset);

#ifdef HAL_EXTI_USE_CONNECTOR
static EXTI_Core_TypeDef *getExtiConnector(EXTI_HandleTypeDef *hexti)
{
  if (hexti->Instance == EXTI2)
  {
#if defined(CORE_CM0PLUS)
    return EXTI2_C3;
#endif  /* CORE_CM0PLUS */
#if defined(CORE_CM33)
    return EXTI2_C2;
#endif  /* CORE_CM33 */
#if defined(CORE_CA35)
    return EXTI2_C1;
#endif  /* CORE_CA35 */
  }
  else
  {
#if defined(EXTI1)
#if defined(CORE_CM33)
    return EXTI1_C2;
#endif  /* CORE_CM33 */
#if defined(CORE_CA35)
    return EXTI1_C1;
#endif  /* CORE_CA35 */
#else   /* EXTI1 */
    return NULL;
#endif  /* EXTI1 */
  }
}
#endif  /* HAL_EXTI_USE_CONNECTOR */
/* Exported functions --------------------------------------------------------*/

/** @addtogroup EXTI_Exported_Functions
  * @{
  */

/** @addtogroup EXTI_Exported_Functions_Group1
  *  @brief    Configuration functions
  *
@verbatim
 ===============================================================================
              ##### Configuration functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Set configuration of a dedicated Exti line.
  * @param  hexti Exti handle to initialize from pExtiConfig config.
  * @param  pExtiConfig Pointer on EXTI configuration to be set.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_EXTI_SetConfigLine(EXTI_HandleTypeDef *hexti, const EXTI_ConfigTypeDef *pExtiConfig)
{
  __IO uint32_t *regaddr;
  uint32_t regval;
  uint32_t linepos;
  uint32_t maskline;
  uint32_t offset;
#ifdef HAL_EXTI_USE_CONNECTOR
  EXTI_Core_TypeDef *EXTI_CurrentCPU;
#endif  /* HAL_EXTI_USE_CONNECTOR */

  /* Check null pointer */
  if ((hexti == NULL) || (pExtiConfig == NULL))
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_EXTI_LINE(pExtiConfig->Line));
  assert_param(IS_EXTI_MODE(pExtiConfig->Mode));

  if ((pExtiConfig->Line & EXTI_INDEX_MASK) ==  EXTI_EXTI2)
  {
    hexti->Instance = EXTI2;
  }
  else
  {
#if defined(CORE_CM0PLUS)
    /* EXTI1 can't be accessed from M0Plus */
    return HAL_ERROR;
#else   /* CORE_CM0PLUS */
    hexti->Instance = EXTI1;
#endif  /* CORE_CM0PLUS */
  }

  /* get address of used CPU connector interface */
#ifdef HAL_EXTI_USE_CONNECTOR
  EXTI_CurrentCPU = getExtiConnector(hexti);
  if (EXTI_CurrentCPU == NULL)
  {
    return HAL_ERROR;
  }
#endif  /* HAL_EXTI_USE_CONNECTOR */

  /* Assign line config to handle */
  hexti->Line = pExtiConfig->Line;

  /* compute line register offset and line mask */
  linepos = pExtiConfig->Line & EXTI_PIN_MASK;
  offset = linepos / 32U;
  maskline = 1UL << (linepos % 32U);

  /* Configure triggers for configurable lines */
  if ((pExtiConfig->Line & EXTI_CONFIG) != 0U)
  {
    assert_param(IS_EXTI_TRIGGER(pExtiConfig->Trigger));

    /* Configure rising trigger */
    regaddr = &hexti->Instance->RTSR1 + (EXTI_CONFIG_OFFSET * offset);

    regval = *regaddr;

    /* Mask or set line */
    if ((pExtiConfig->Trigger & EXTI_TRIGGER_RISING) != 0U)
    {
      regval |= maskline;
    }
    else
    {
      regval &= ~maskline;
    }

    /* Store rising trigger mode */
    *regaddr = regval;

    /* Configure falling trigger */
    regaddr = &hexti->Instance->FTSR1 + (EXTI_CONFIG_OFFSET * offset);
    regval = *regaddr;

    /* Mask or set line */
    if ((pExtiConfig->Trigger & EXTI_TRIGGER_FALLING) != 0U)
    {
      regval |= maskline;
    }
    else
    {
      regval &= ~maskline;
    }

    /* Store falling trigger mode */
    *regaddr = regval;

    /* Configure gpio port selection in case of gpio exti line */
    if ((pExtiConfig->Line & EXTI_GPIO) == EXTI_GPIO)
    {
      assert_param(IS_EXTI_GPIO_PORT(hexti->Instance, pExtiConfig->GPIOSel));
      assert_param(IS_EXTI_GPIO_PIN(hexti->Instance, linepos));

      /* sanity check for EXTICR access */
      if (linepos < 16U)
      {
        regval = hexti->Instance->EXTICR[linepos >> 2u];
        regval &= ~(EXTI_EXTICR1_EXTI0 << (EXTI_EXTICR1_EXTI1_Pos * (linepos & 0x03u)));
        regval |= (pExtiConfig->GPIOSel << (EXTI_EXTICR1_EXTI1_Pos * (linepos & 0x03u)));
        hexti->Instance->EXTICR[linepos >> 2u] = regval;
      }
    }
  }

  /* Configure interrupt mode : read current mode */
#ifdef HAL_EXTI_USE_CONNECTOR
  regaddr = (uint32_t *)(&EXTI_CurrentCPU->IMR1 + (EXTI_MODE_OFFSET * offset));
  regval = *regaddr;
#else   /* HAL_EXTI_USE_CONNECTOR */
  regval = EXTI_GetImr(hexti->Instance, offset);
#endif  /* HAL_EXTI_USE_CONNECTOR */

  /* Mask or set line */
  if ((pExtiConfig->Mode & EXTI_MODE_INTERRUPT) != 0U)
  {
    regval |= maskline;
  }
  else
  {
    regval &= ~maskline;
  }

  /* Store interrupt mode */
#ifdef HAL_EXTI_USE_CONNECTOR
  *regaddr = regval;
#else   /* HAL_EXTI_USE_CONNECTOR */
  EXTI_SetImr(hexti->Instance, offset, regval);
#endif  /* HAL_EXTI_USE_CONNECTOR */

  /* Configure event mode : read current mode */
  if (EXTI_CheckEmr(hexti->Instance, offset) == 1U)
  {
#ifdef HAL_EXTI_USE_CONNECTOR
    regaddr = (uint32_t *)(&EXTI_CurrentCPU->EMR1 + (EXTI_MODE_OFFSET * offset));
    regval = *regaddr;
#else   /* HAL_EXTI_USE_CONNECTOR */
    regval = EXTI_GetEmr(hexti->Instance, offset);
#endif  /* HAL_EXTI_USE_CONNECTOR */

    /* Mask or set line */
    if ((pExtiConfig->Mode & EXTI_MODE_EVENT) != 0U)
    {
      /* The event mode cannot be configured if the line does not support it */
      assert_param(IS_EXTI_EVENT_PRESENT(pExtiConfig->Line));
      regval |= maskline;
    }
    else
    {
      regval &= ~maskline;
    }

    /* Store event mode */
#ifdef HAL_EXTI_USE_CONNECTOR
    *regaddr = regval;
#else   /* HAL_EXTI_USE_CONNECTOR */
    EXTI_SetEmr(hexti->Instance, offset, regval);
#endif  /* HAL_EXTI_USE_CONNECTOR */
  }

  return HAL_OK;
}


/**
  * @brief  Get configuration of a dedicated Exti line.
  * @param  hexti Exti handle.
  * @param  pExtiConfig Pointer on structure to store Exti configuration.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_EXTI_GetConfigLine(EXTI_HandleTypeDef *hexti, EXTI_ConfigTypeDef *pExtiConfig)
{
#ifdef HAL_EXTI_USE_CONNECTOR
  __IO uint32_t *regaddr;
#endif  /* HAL_EXTI_USE_CONNECTOR */
  uint32_t regval;
  uint32_t linepos;
  uint32_t maskline;
  uint32_t offset;
#ifdef HAL_EXTI_USE_CONNECTOR
  EXTI_Core_TypeDef *EXTI_CurrentCPU;
#endif  /* HAL_EXTI_USE_CONNECTOR */

  /* Check null pointer */
  if ((hexti == NULL) || (pExtiConfig == NULL))
  {
    return HAL_ERROR;
  }

  /* Check the parameter */
  assert_param(IS_EXTI_LINE(hexti->Line));


#ifdef HAL_EXTI_USE_CONNECTOR
  /* get address of used CPU connector interface */
  EXTI_CurrentCPU = getExtiConnector(hexti);
  if (EXTI_CurrentCPU == NULL)
  {
    return HAL_ERROR;
  }
#endif  /* HAL_EXTI_USE_CONNECTOR */

  /* Store handle line number to configure structure */
  pExtiConfig->Line = hexti->Line;

