zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_exti.c
  /* compute line register offset and line mask */
  linepos = (pExtiConfig->Line & EXTI_PIN_MASK);
  offset = linepos / 32U;
  maskline = 1uL << (linepos % 32U);

  /* 1] Get core mode : interrupt */
#ifdef HAL_EXTI_USE_CONNECTOR
  regaddr = (uint32_t *)(&EXTI_CurrentCPU->IMR1 + (EXTI_MODE_OFFSET * offset));
  regval = *regaddr;
#else   /* HAL_EXTI_USE_CONNECTOR */
  regval = EXTI_GetImr(hexti->Instance, offset);
#endif  /* HAL_EXTI_USE_CONNECTOR */

  /* Check if selected line is enable */
  if ((regval & maskline) != 0U)
  {
    pExtiConfig->Mode = EXTI_MODE_INTERRUPT;
  }
  else
  {
    pExtiConfig->Mode = EXTI_MODE_NONE;
  }

  /* Get event mode */
#ifdef HAL_EXTI_USE_CONNECTOR
  regaddr = (uint32_t *)(&EXTI_CurrentCPU->EMR1 + (EXTI_MODE_OFFSET * offset));
  regval = *regaddr;
#else   /* HAL_EXTI_USE_CONNECTOR */
  regval = EXTI_GetEmr(hexti->Instance, offset);
#endif  /* HAL_EXTI_USE_CONNECTOR */

  /* Check if selected line is enable */
  if ((regval & maskline) != 0U)
  {
    pExtiConfig->Mode |= EXTI_MODE_EVENT;
  }

  /* 2] Get trigger for configurable lines : rising */
  if ((pExtiConfig->Line & EXTI_CONFIG) != 0x00u)
  {
#ifdef HAL_EXTI_USE_CONNECTOR
    regaddr = &hexti->Instance->RTSR1 + (EXTI_CONFIG_OFFSET * offset);
    regval = *regaddr;
#else   /* HAL_EXTI_USE_CONNECTOR */
    regval = EXTI_GetRtsr(hexti->Instance, offset);
#endif  /* HAL_EXTI_USE_CONNECTOR */

    /* Check if configuration of selected line is enable */
    if ((regval & maskline) != 0x00u)
    {
      pExtiConfig->Trigger = EXTI_TRIGGER_RISING;
    }
    else
    {
      pExtiConfig->Trigger = EXTI_TRIGGER_NONE;
    }

    /* Get falling configuration */
#ifdef HAL_EXTI_USE_CONNECTOR
    regaddr = &hexti->Instance->FTSR1 + (EXTI_CONFIG_OFFSET * offset);
    regval = *regaddr;
#else   /* HAL_EXTI_USE_CONNECTOR */
    regval = EXTI_GetFtsr(hexti->Instance, offset);
#endif  /* HAL_EXTI_USE_CONNECTOR */

    /* Check if configuration of selected line is enable */
    if ((regval & maskline) != 0U)
    {
      pExtiConfig->Trigger |= EXTI_TRIGGER_FALLING;
    }

    /* Get Gpio port selection for gpio lines */
    if ((pExtiConfig->Line & EXTI_GPIO) == EXTI_GPIO)
    {
      regval = hexti->Instance->EXTICR[(linepos >> 2U) & 0x03UL];
      pExtiConfig->GPIOSel = (
                               (
                                 regval <<
                                 (EXTI_EXTICR1_EXTI1_Pos * (((32u / EXTI_EXTICR1_EXTI1_Pos) - 1u) - (linepos & 0x03u)))
                               ) >> (32u - EXTI_EXTICR1_EXTI1_Pos)
                             );
    }
    else
    {
      pExtiConfig->GPIOSel = 0U;
    }
  }
  else
  {
    pExtiConfig->Trigger = EXTI_TRIGGER_NONE;
    pExtiConfig->GPIOSel = 0U;
  }

  return HAL_OK;
}


/**
  * @brief  Clear whole configuration of a dedicated Exti line.
  * @param  hexti Exti handle.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_EXTI_ClearConfigLine(EXTI_HandleTypeDef *hexti)
{
  __IO uint32_t *regaddr;
  uint32_t regval;
  uint32_t linepos;
  uint32_t maskline;
  uint32_t offset;
#ifdef HAL_EXTI_USE_CONNECTOR
  EXTI_Core_TypeDef *EXTI_CurrentCPU;
#endif  /* HAL_EXTI_USE_CONNECTOR */


  /* Check null pointer */
  if (hexti == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameter */
  assert_param(IS_EXTI_LINE(hexti->Line));


#ifdef HAL_EXTI_USE_CONNECTOR
  /* get address of used CPU connector interface */
  EXTI_CurrentCPU = getExtiConnector(hexti);
  if (EXTI_CurrentCPU == NULL)
  {
    return HAL_ERROR;
  }
#endif  /* HAL_EXTI_USE_CONNECTOR */

  /* compute line register offset and line mask */
  linepos = (hexti->Line & EXTI_PIN_MASK);
  offset = linepos / 32U;
  maskline = 1UL << (linepos % 32U);

  /* 1] Clear interrupt mode */
#ifdef HAL_EXTI_USE_CONNECTOR
  regaddr = (uint32_t *)(&EXTI_CurrentCPU->IMR1 + (EXTI_MODE_OFFSET * offset));
  regval = (*regaddr & ~maskline);
  *regaddr = regval;
#else   /* HAL_EXTI_USE_CONNECTOR */
  regval = EXTI_GetImr(hexti->Instance, offset);
  regval &= ~maskline;
  EXTI_Exti2_SetImr(offset, regval);
#endif  /* HAL_EXTI_USE_CONNECTOR */

  /* 2] Clear event mode */
#ifdef HAL_EXTI_USE_CONNECTOR
  regaddr = (uint32_t *)(&EXTI_CurrentCPU->EMR1 + (EXTI_MODE_OFFSET * offset));
  regval = (*regaddr & ~maskline);
  *regaddr = regval;
#else   /* HAL_EXTI_USE_CONNECTOR */
  if (EXTI_CheckEmr(hexti->Instance, offset) == 1U)
  {
    regval = EXTI_GetEmr(hexti->Instance, offset);
    regval &= ~maskline;
    EXTI_SetEmr(hexti->Instance, offset, regval);
  }
#endif  /* HAL_EXTI_USE_CONNECTOR */

  /* 3] Clear triggers in case of configurable lines */
  if ((hexti->Line & EXTI_CONFIG) != 0U)
  {
    regaddr = &hexti->Instance->RTSR1 + (EXTI_CONFIG_OFFSET * offset);
    regval = (*regaddr & ~maskline);
    *regaddr = regval;

    regaddr = &hexti->Instance->FTSR1 + (EXTI_CONFIG_OFFSET * offset);
    regval = (*regaddr & ~maskline);
    *regaddr = regval;

    /* Get Gpio port selection for gpio lines */
    if ((hexti->Line & EXTI_GPIO) == EXTI_GPIO)
    {
      /* sanity check for EXTICR access */
      if (linepos < 16U)
      {
        regval = hexti->Instance->EXTICR[linepos >> 2u];
        regval &= ~(EXTI_EXTICR1_EXTI0 << (EXTI_EXTICR1_EXTI1_Pos * (linepos & 0x03u)));
        hexti->Instance->EXTICR[linepos >> 2U] = regval;
      }
    }
  }

  return HAL_OK;
}


/**
  * @brief  Register callback for a dedicaated Exti line.
  * @param  hexti Exti handle.
  * @param  CallbackID User callback identifier.
  *         This parameter can be one of @arg @ref EXTI_CallbackIDTypeDef values.
  * @param  pPendingCbfn function pointer to be stored as callback.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_EXTI_RegisterCallback(EXTI_HandleTypeDef *hexti, EXTI_CallbackIDTypeDef CallbackID,
                                            void (*pPendingCbfn)(void))
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check null pointer */
  if (hexti == NULL)
  {
    return HAL_ERROR;
  }

  switch (CallbackID)
  {
    case  HAL_EXTI_COMMON_CB_ID:
      hexti->RisingCallback = pPendingCbfn;
      hexti->FallingCallback = pPendingCbfn;
      break;

    case  HAL_EXTI_RISING_CB_ID:
      hexti->RisingCallback = pPendingCbfn;
      break;

    case  HAL_EXTI_FALLING_CB_ID:
      hexti->FallingCallback = pPendingCbfn;
      break;

    default:
      status = HAL_ERROR;
      break;
  }

