zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_exti.c
  return status;
}


/**
  * @brief  Store line number as handle private field.
  * @param  hexti Exti handle.
  * @param  ExtiLine Exti line number.
  *         This parameter can be either 0 to @ref EXTI1_LINE_NB or 0 to @ref EXTI2_LINE_NB.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_EXTI_GetHandle(EXTI_HandleTypeDef *hexti, uint32_t ExtiLine)
{

  /* Check null pointer */
  if (hexti == NULL)
  {
    return HAL_ERROR;
  }
  else
  {
    /* Check the parameters */
    assert_param(IS_EXTI_LINE(ExtiLine));

    /* Store line number as handle private field */
    hexti->Line = ExtiLine;

    /*Store instance as handle private field*/
    if ((ExtiLine & EXTI_INDEX_MASK) ==  EXTI_EXTI2)
    {
      hexti->Instance = EXTI2;
    }
    else
    {
#if defined(CORE_CM0PLUS)
      /* EXTI1 can't be accessed from M0Plus */
      return HAL_ERROR;
#else   /* CORE_CM0PLUS */
      hexti->Instance = EXTI1;
#endif  /* CORE_CM0PLUS */
    }
    return HAL_OK;
  }
}


/**
  * @}
  */

/** @addtogroup EXTI_Exported_Functions_Group2
  *  @brief EXTI IO functions.
  *
@verbatim
 ===============================================================================
                       ##### IO operation functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Handle EXTI interrupt request.
  * @param  hexti Exti handle.
  * @retval none.
  */
void HAL_EXTI_IRQHandler(EXTI_HandleTypeDef *hexti)
{
  __IO uint32_t *regaddr;
  uint32_t regval;
  uint32_t maskline;
  uint32_t linepos;
  uint32_t offset;

  /* Compute line register offset and line mask */
  linepos = (hexti->Line & EXTI_PIN_MASK);
  offset = linepos / 32U;
  maskline = 1UL << (linepos % 32U);

  /* Get pending bit  */
  regaddr = &hexti->Instance->RPR1 + (EXTI_CONFIG_OFFSET * offset);
  regval = (*regaddr & maskline);

  if (regval != 0U)
  {
    /* Clear pending bit */
    *regaddr = maskline;

    /* Call rising callback */
    if (hexti->RisingCallback != NULL)
    {
      hexti->RisingCallback();
    }
  }

  /* Get pending bit  */
  regaddr = &hexti->Instance->FPR1 + (EXTI_CONFIG_OFFSET * offset);
  regval = (*regaddr & maskline);

  if (regval != 0U)
  {
    /* Clear pending bit */
    *regaddr = maskline;

    /* Call rising callback */
    if (hexti->FallingCallback != NULL)
    {
      hexti->FallingCallback();
    }
  }
}


/**
  * @brief  Get interrupt pending bit of a dedicated line.
  * @param  hexti Exti handle.
  * @param  Edge Specify which pending edge as to be checked.
  *         This parameter can be one of the following values:
  *           @arg @ref EXTI_TRIGGER_RISING
  *           @arg @ref EXTI_TRIGGER_FALLING
  *           @arg @ref EXTI_TRIGGER_RISING_FALLING
  * @retval 1 if interrupt is pending else 0.
  */
uint32_t HAL_EXTI_GetPending(const EXTI_HandleTypeDef *hexti, uint32_t Edge)
{
  const __IO uint32_t *regaddr;
  uint32_t regval;
  uint32_t maskline;
  uint32_t linepos;
  uint32_t offset;

  /* Check parameters */
  assert_param(IS_EXTI_LINE(hexti->Line));
  assert_param(IS_EXTI_CONFIG_LINE(hexti->Line));
  assert_param(IS_EXTI_PENDING_EDGE(Edge));

  /* compute line register offset and line mask */
  linepos = (hexti->Line & EXTI_PIN_MASK);
  offset = linepos / 32U;
  maskline = 1UL << (linepos % 32U);

  /* Get rising pending bit */
  if ((Edge & EXTI_TRIGGER_RISING) == EXTI_TRIGGER_RISING)
  {
    regaddr = (__IO uint32_t *)(&hexti->Instance->RPR1 + (EXTI_CONFIG_OFFSET * offset));

    /* return 1 if bit is set else 0 */
    regval = (*regaddr & maskline);

    if (regval != 0U)
    {
      return 1;
    }
  }
  /* Get falling pending bit */
  if ((Edge & EXTI_TRIGGER_FALLING) == EXTI_TRIGGER_FALLING)
  {
    regaddr = &hexti->Instance->FPR1 + (EXTI_CONFIG_OFFSET * offset);

    /* return 1 if bit is set else 0 */
    regval = (*regaddr & maskline);
    if (regval != 0U)
    {
      return 1;
    }
  }

  return 0;
}


/**
  * @brief  Clear interrupt pending bit of a dedicated line.
  * @param  hexti Exti handle.
  * @param  Edge Specify which pending edge as to be clear.
  *         This parameter can be one of the following values:
  *           @arg @ref EXTI_TRIGGER_RISING
  *           @arg @ref EXTI_TRIGGER_FALLING
  *           @arg @ref EXTI_TRIGGER_RISING_FALLING
  * @retval None.
  */
void HAL_EXTI_ClearPending(EXTI_HandleTypeDef *hexti, uint32_t Edge)
{
  __IO uint32_t *regaddr;
  uint32_t maskline;
  uint32_t linepos;
  uint32_t offset;


  if (hexti == NULL)
  {
    return;
  }

  /* Check parameters */
  assert_param(IS_EXTI_LINE(hexti->Line));
  assert_param(IS_EXTI_CONFIG_LINE(hexti->Line));
  assert_param(IS_EXTI_PENDING_EDGE(Edge));

  /* compute line register offset and line mask */
  linepos = (hexti->Line & EXTI_PIN_MASK);
  offset = linepos / 32U;
  maskline = 1UL << (linepos % 32U);

  if ((Edge & EXTI_TRIGGER_RISING) == EXTI_TRIGGER_RISING)
  {
    /* Get pending register address */
    regaddr = &hexti->Instance->RPR1 + (EXTI_CONFIG_OFFSET * offset);

    /* Clear Pending bit */
    *regaddr =  maskline;
  }
  if ((Edge & EXTI_TRIGGER_FALLING) == EXTI_TRIGGER_FALLING)
  {
    /* Get pending register address */
    regaddr = &hexti->Instance->FPR1 + (EXTI_CONFIG_OFFSET * offset);

    /* Clear Pending bit */
    *regaddr =  maskline;
  }

}


/**
  * @brief  Generate a software interrupt for a dedicated line.
  * @param  hexti Exti handle.
  * @retval None.
  */
void HAL_EXTI_GenerateSWI(const EXTI_HandleTypeDef *hexti)
{
  __IO uint32_t *regaddr;
  uint32_t maskline;
  uint32_t linepos;
  uint32_t offset;

  if (hexti == NULL)
  {
    return;
  }

  /* Check the parameter */
  assert_param(IS_EXTI_LINE(hexti->Line));
  assert_param(IS_EXTI_CONFIG_LINE(hexti->Line));

  /* compute line register offset and line mask */
  linepos = (hexti->Line & EXTI_PIN_MASK);
  offset = linepos / 32U;
  maskline = 1uL << (linepos % 32U);

  regaddr = &hexti->Instance->SWIER1 + (EXTI_CONFIG_OFFSET * offset);
  *regaddr = maskline;
}

/**
  * @}
  */


/* Register Access control  functions  *******************************************/
/** @addtogroup EXTI_Exported_Functions_Group3 Register Access control functions
  * @{
  */


/**
  * @brief  Configure RIF attribute of an EXTI event line
  *         Available RIF attributes are CID, security and privilege protection.
  * @note   If no CID attribute provide, CID filtering is disabled.
  * @param  ExtiLine : Exti line number.
  * @param  LineAttributes: RIF (CID/secure/privilege) attributes.

  * @retval void.

  */
void HAL_EXTI_ConfigLineAttributes(uint32_t ExtiLine, uint32_t LineAttributes)
{
  __IO uint32_t *regaddr;
  __IO uint32_t *regaddrP;
#if defined (CORTEX_IN_SECURE_STATE)
  __IO uint32_t *regaddrS;
#endif  /* CORTEX_IN_SECURE_STATE */
  uint32_t eventCurrent;
  uint32_t linepos;
  uint32_t offset;
  EXTI_TypeDef *Instance;

  /* Check the parameters */
  assert_param(IS_EXTI_LINE(ExtiLine));
  assert_param(IS_EXTI_LINE_ATTRIBUTES(LineAttributes));

