zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_exti.c
  /* compute line register offset and line mask */
  linepos = (ExtiLine & EXTI_PIN_MASK);
  offset = linepos / 32U;

  if ((ExtiLine & EXTI_INDEX_MASK) ==  EXTI_EXTI2)
  {
    Instance = EXTI2;
  }
  else
  {
#if defined(CORE_CM0PLUS)
    /* EXTI1 can't be accessed from M0Plus */
    return;
#else   /* CORE_CM0PLUS */
    Instance = EXTI1;
#endif  /* CORE_CM0PLUS */
  }

  /* Configure Event attribute */
#if defined (CORTEX_IN_SECURE_STATE)
  regaddrS = &Instance->SECCFGR1 + (EXTI_CONFIG_OFFSET * offset);
#endif  /* CORTEX_IN_SECURE_STATE */
  regaddrP = &Instance->PRIVCFGR1 + (EXTI_CONFIG_OFFSET * offset);

  eventCurrent = 1UL << (linepos % 32UL);

#if defined (CORTEX_IN_SECURE_STATE)
  if ((LineAttributes & EXTI_LINE_ATTR_SEC_SELECT) == EXTI_LINE_ATTR_SEC_SELECT)
  {
    /* Configure secure/non-secure attribute */
    if ((LineAttributes & EXTI_LINE_SEC) == EXTI_LINE_SEC)
    {
      *regaddrS |= eventCurrent;
    }
    else
    {
      *regaddrS &= (~eventCurrent);
    }
  }
#endif  /* CORTEX_IN_SECURE_STATE */
  if ((LineAttributes & EXTI_LINE_ATTR_PRIV_SELECT) == EXTI_LINE_ATTR_PRIV_SELECT)
  {
    /* Configure privilege/non-privilege attribute */
    if ((LineAttributes & EXTI_LINE_PRIV) == EXTI_LINE_PRIV)
    {
      *regaddrP |= eventCurrent;
    }
    else
    {
      *regaddrP &= (~eventCurrent);
    }
  }
  /* Selected register corresponding to current event */
  regaddr = &Instance->ECIDCFGR[0] + (EXTI_LINE_CID_CFG_ADD_OFFSET * linepos);
  *regaddr = 0;  /*remove any CID filtering on selected pin*/
  if ((LineAttributes & (EXTI_LINE_CID_DISABLE | EXTI_LINE_ATTR_CID_STATIC_SELECT)) == EXTI_LINE_ATTR_CID_STATIC_SELECT)
    /*static CID field value used ONLY is CID filtering not disable */
  {
    /* Write static CID configuration */
    *regaddr = ((LineAttributes & EXTI_EnCIDCFGR_CID_Msk) | EXTI_EnCIDCFGR_CFEN);
  }
}

/**
  * @brief  Get a RIF attributes of an EXTI event line.
  * @param  ExtiLine : Exti line number.
  * @param  pLineAttributes : pointer of  RIF attributes.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_EXTI_GetConfigLineAttributes(uint32_t ExtiLine, uint32_t *pLineAttributes)
{
  __I uint32_t *regaddr;
  __I uint32_t *regaddrP;
#if defined (CORTEX_IN_SECURE_STATE)
  __IO uint32_t *regaddrS;
#endif  /* CORTEX_IN_SECURE_STATE */
  uint32_t eventCurrent;
  uint32_t offset;
  uint32_t linepos;
  const EXTI_TypeDef *Instance;

  /* Check null pointer */
  if (pLineAttributes == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_EXTI_LINE(ExtiLine));
  *pLineAttributes = 0;

  /* compute line register offset and line mask */
  linepos = (ExtiLine & EXTI_PIN_MASK);
  offset = linepos / 32U;

  if ((ExtiLine & EXTI_INDEX_MASK) ==  EXTI_EXTI2)
  {
    Instance = EXTI2;
  }
  else
  {
#if defined(CORE_CM0PLUS)
    /* EXTI1 can't be accessed from M0Plus */
    return HAL_ERROR;
#else   /* CORE_CM0PLUS */
    Instance = EXTI1;
#endif  /* CORE_CM0PLUS */
  }

#if defined (CORTEX_IN_SECURE_STATE)
  regaddrS = (uint32_t *)&Instance->SECCFGR1 + (EXTI_CONFIG_OFFSET * offset);
#endif  /* CORTEX_IN_SECURE_STATE */
  regaddrP = &Instance->PRIVCFGR1 + (EXTI_CONFIG_OFFSET * offset);

  eventCurrent = 1UL << (linepos % 32UL);


#if defined (CORTEX_IN_SECURE_STATE)
  *pLineAttributes |= ((*regaddrS & eventCurrent)  == 0U) ? EXTI_LINE_NSEC  : EXTI_LINE_SEC;
#endif  /* CORTEX_IN_SECURE_STATE */
  *pLineAttributes |= ((*regaddrP & eventCurrent) == 0U) ? EXTI_LINE_NPRIV : EXTI_LINE_PRIV;

  /* Select register corresponding to current event */
  regaddr = &Instance->ECIDCFGR[0] + (EXTI_LINE_CID_CFG_ADD_OFFSET * linepos);
  if ((*regaddr & EXTI_EnCIDCFGR_CFEN_Msk) == EXTI_EnCIDCFGR_CFEN)
  {
    /* Get CIDs value from Static CID field */
    *pLineAttributes |= (EXTI_LINE_ATTR_CID_STATIC_SELECT | ((*regaddr) & EXTI_EnCIDCFGR_CID_Msk));
  }
  else
  {
    *pLineAttributes |= EXTI_LINE_CID_DISABLE;
  }
  return HAL_OK;
}

/**
  * @}
  */

#if defined (CORE_CA35) || defined (CORE_CM33)
/* EXTI1 can't be accessed from M0Plus */

uint32_t EXTI_Exti1_GetImr1(void)
{
#if defined (CORE_CA35)
  return EXTI1->C1IMR1;
#elif defined(CORE_CM33)
  return EXTI1->C2IMR1;
#endif  /* CORE_CA35 | CORE_CM33 */
}

uint32_t EXTI_Exti1_GetImr2(void)
{
#if defined (CORE_CA35)
  return EXTI1->C1IMR2;
#elif defined(CORE_CM33)
  return EXTI1->C2IMR2;
#endif  /* CORE_CA35 | CORE_CM33 */
}

uint32_t EXTI_Exti1_GetImr3(void)
{
#if defined (CORE_CA35)
  return EXTI1->C1IMR3;
#elif defined(CORE_CM33)
  return EXTI1->C2IMR3;
#endif  /* CORE_CA35 | CORE_CM33 */
}

void EXTI_Exti1_SetImr1(uint32_t u32Value)
{
#if defined (CORE_CA35)
  EXTI1->C1IMR1 = u32Value;
#elif defined(CORE_CM33)
  EXTI1->C2IMR1 = u32Value;
#endif  /* CORE_CA35 | CORE_CM33 */
}

void EXTI_Exti1_SetImr2(uint32_t u32Value)
{
#if defined (CORE_CA35)
  EXTI1->C1IMR2 = u32Value;
#elif defined(CORE_CM33)
  EXTI1->C2IMR2 = u32Value;
#endif  /* CORE_CA35 | CORE_CM33 */
}

void EXTI_Exti1_SetImr3(uint32_t u32Value)
{
#if defined (CORE_CA35)
  EXTI1->C1IMR3 = u32Value;
#elif defined(CORE_CM33)
  EXTI1->C2IMR3 = u32Value;
#endif  /* CORE_CA35 | CORE_CM33 */
}

uint32_t EXTI_Exti1_GetEmr1(void)
{
#if defined (CORE_CA35)
  /*no event connected to C1EMR1*/
  return 0;
#elif defined(CORE_CM33)
  return EXTI1->C2EMR1;
#endif  /* CORE_CA35 | CORE_CM33 */
}

uint32_t EXTI_Exti1_GetEmr3(void)
{
#if defined (CORE_CA35)
  /*no event connected to C1EMR3*/
  return 0;
#elif defined(CORE_CM33)
  return EXTI1->C2EMR3;
#endif  /* CORE_CA35 | CORE_CM33 */
}

void EXTI_Exti1_SetEmr1(uint32_t u32Value)
{
#if defined (CORE_CA35)
  /*no event connected to C1EMR1*/
  UNUSED(u32Value);
#elif defined(CORE_CM33)
  EXTI1->C2EMR1 = u32Value;
#endif  /* CORE_CA35 | CORE_CM33 */
}

void EXTI_Exti1_SetEmr3(uint32_t u32Value)
{
#if defined (CORE_CA35)
  /*no event connected to C1EMR3*/
  UNUSED(u32Value);
#elif defined(CORE_CM33)
  EXTI1->C2EMR3 = u32Value;
#endif  /* CORE_CA35 | CORE_CM33 */
}

void EXTI_Exti1_SetEmr(uint32_t u32Offset, uint32_t u32Value)
{
  /* EMR2 not available*/
  if (u32Offset == 0U)
  {
    EXTI_Exti1_SetEmr1(u32Value);
  }
  else if (u32Offset == 2U)
  {
    EXTI_Exti1_SetEmr3(u32Value);
  }
  else
  {
    /* Nothing to do */
  }
}

