zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_exti.c
uint32_t EXTI_Exti1_GetEmr(uint32_t u32Offset)
{
  /* EMR2 not available*/
  if (u32Offset == 0U)
  {
    return EXTI_Exti1_GetEmr1();
  }
  else if (u32Offset == 2U)
  {
    return EXTI_Exti1_GetEmr3();
  }
  else
  {
    /* Nothing to do */
  }
  return 0;
}


uint32_t EXTI_Exti1_CheckEmr(uint32_t u32Offset)
{
  if (u32Offset == 0U)
  {
    return 1;
  }
  else if (u32Offset == 1U)
  {
    /* EMR2 not available*/
    return 0;
  }
  else if (u32Offset == 2U)
  {
    return 1;
  }
  else
  {
    return 0;
  }
}


void EXTI_Exti1_SetImr(uint32_t u32Offset, uint32_t u32Value)
{
  if (u32Offset == 0U)
  {
    EXTI_Exti1_SetImr1(u32Value);
  }
  else if (u32Offset == 1U)
  {
    EXTI_Exti1_SetImr2(u32Value);
  }
  else if (u32Offset == 2U)
  {
    EXTI_Exti1_SetImr3(u32Value);
  }
  else
  {
    /* Nothing to do */
  }
}

uint32_t EXTI_Exti1_GetImr(uint32_t u32Offset)
{
  if (u32Offset == 0U)
  {
    return EXTI_Exti1_GetImr1();
  }
  else if (u32Offset == 1U)
  {
    return EXTI_Exti1_GetImr2();
  }
  else if (u32Offset == 2U)
  {
    return EXTI_Exti1_GetImr3();
  }
  else
  {
    return 0;
  }
}

uint32_t EXTI_Exti1_CheckImr(uint32_t u32Offset)
{
  if (u32Offset == 0U)
  {
    return 1;
  }
  else if (u32Offset == 1U)
  {
    return 1;
  }
  else if (u32Offset == 2U)
  {
    return 1;
  }
  else
  {
    return 0;
  }
}

#endif  /* CORE_CA35 | CORE_CM33 */


uint32_t EXTI_Exti2_GetImr1(void)
{
#if defined (CORE_CA35)
  return EXTI2->C1IMR1;
#elif defined(CORE_CM33)
  return EXTI2->C2IMR1;
#elif defined(CORE_CM0PLUS)
  return EXTI2->C3IMR1;
#endif  /* CORE_CA35 | CORE_CM33 | CORE_CM0PLUS */
}

uint32_t EXTI_Exti2_GetImr2(void)
{
#if defined (CORE_CA35)
  return EXTI2->C1IMR2;
#elif defined(CORE_CM33)
  return EXTI2->C2IMR2;
#elif defined(CORE_CM0PLUS)
  return EXTI2->C3IMR2;
#endif  /* CORE_CA35 | CORE_CM33 | CORE_CM0PLUS */
}

uint32_t EXTI_Exti2_GetImr3(void)
{
#if defined (CORE_CA35)
  return EXTI2->C1IMR3;
#elif defined(CORE_CM33)
  return EXTI2->C2IMR3;
#elif defined(CORE_CM0PLUS)
  return EXTI2->C3IMR3;
#endif  /* CORE_CA35 | CORE_CM33 | CORE_CM0PLUS */
}

uint32_t EXTI_Exti2_GetEmr1(void)
{
#if defined (CORE_CA35)
  /*no event connected to C1EMR1*/
  return 0;
#elif defined(CORE_CM33)
  return EXTI2->C2EMR1;
#elif defined(CORE_CM0PLUS)
  return EXTI2->C3EMR1;
#endif  /* CORE_CA35 | CORE_CM33 | CORE_CM0PLUS */
}

uint32_t EXTI_Exti2_GetEmr2(void)
{
#if defined (CORE_CA35)
  /*no event connected to C1EMR2*/
  return 0;
#elif defined(CORE_CM33)
  return EXTI2->C2EMR2;
#elif defined(CORE_CM0PLUS)
  return EXTI2->C3EMR2;
#endif  /* CORE_CA35 | CORE_CM33 | CORE_CM0PLUS */
}

/* EMR3 not available*/


void EXTI_Exti2_SetImr1(uint32_t u32Value)
{
#if defined (CORE_CA35)
  EXTI2->C1IMR1 = u32Value;
#elif defined(CORE_CM33)
  EXTI2->C2IMR1 = u32Value;
#elif defined(CORE_CM0PLUS)
  EXTI2->C3IMR1 = u32Value;
#endif  /* CORE_CA35 | CORE_CM33 | CORE_CM0PLUS */
}

void EXTI_Exti2_SetImr2(uint32_t u32Value)
{
#if defined (CORE_CA35)
  EXTI2->C1IMR2 = u32Value;
#elif defined(CORE_CM33)
  EXTI2->C2IMR2 = u32Value;
#elif defined(CORE_CM0PLUS)
  EXTI2->C3IMR2 = u32Value;
#endif  /* CORE_CA35 | CORE_CM33 | CORE_CM0PLUS */
}

void EXTI_Exti2_SetImr3(uint32_t u32Value)
{
#if defined (CORE_CA35)
  EXTI2->C1IMR3 = u32Value;
#elif defined(CORE_CM33)
  EXTI2->C2IMR3 = u32Value;
#elif defined(CORE_CM0PLUS)
  EXTI2->C3IMR3 = u32Value;
#endif  /* CORE_CA35 | CORE_CM33 | CORE_CM0PLUS */
}

void EXTI_Exti2_SetEmr1(uint32_t u32Value)
{
#if defined (CORE_CA35)
  /*no event connected to C1EMR1*/
  UNUSED(u32Value);
#elif defined(CORE_CM33)
  EXTI2->C2EMR1 = u32Value;
#elif defined(CORE_CM0PLUS)
  EXTI2->C3EMR1 = u32Value;
#endif  /* CORE_CA35 | CORE_CM33 | CORE_CM0PLUS */
}

void EXTI_Exti2_SetEmr2(uint32_t u32Value)
{
#if defined (CORE_CA35)
  /*no event connected to C1EMR2*/
  UNUSED(u32Value);
#elif defined(CORE_CM33)
  EXTI2->C2EMR2 = u32Value;
#elif defined(CORE_CM0PLUS)
  EXTI2->C3EMR2 = u32Value;
#endif  /* CORE_CA35 | CORE_CM33 | CORE_CM0PLUS */
}

/* EMR3 not available*/


void EXTI_Exti2_SetEmr(uint32_t u32Offset, uint32_t u32Value)
{
  if (u32Offset == 0U)
  {
    EXTI_Exti2_SetEmr1(u32Value);
  }
  else if (u32Offset == 1U)
  {
    EXTI_Exti2_SetEmr2(u32Value);
  }
  /* EMR3 not available*/
  else
  {
    /* Nothing to do */
  }
}


void EXTI_Exti2_SetImr(uint32_t u32Offset, uint32_t u32Value)
{
  if (u32Offset == 0U)
  {
    EXTI_Exti2_SetImr1(u32Value);
  }
  else if (u32Offset == 1U)
  {
    EXTI_Exti2_SetImr2(u32Value);
  }
  else if (u32Offset == 2U)
  {
    EXTI_Exti2_SetImr3(u32Value);
  }
  else
  {
    /* Nothing to do */
  }
}


uint32_t EXTI_Exti2_GetEmr(uint32_t u32Offset)
{
  if (u32Offset == 0U)
  {
    return EXTI_Exti2_GetEmr1();
  }
  else if (u32Offset == 1U)
  {
    return EXTI_Exti2_GetEmr2();
  }
  /* EMR3 not available*/
  else
  {
    return 0;
  }
}


uint32_t EXTI_Exti2_CheckEmr(uint32_t u32Offset)
{
  if (u32Offset == 0U)
  {
    return 1;
  }
  else if (u32Offset == 1U)
  {
    return 1;
  }
  else if (u32Offset == 2U)
  {
    /* EMR3 not available*/
    return 0;
  }
  else
  {
    return 0;
  }
}


uint32_t EXTI_Exti2_GetImr(uint32_t u32Offset)
{
  if (u32Offset == 0U)
  {
    return EXTI_Exti2_GetImr1();
  }
  else if (u32Offset == 1U)
  {
    return EXTI_Exti2_GetImr2();
  }
  else if (u32Offset == 2U)
  {
    return EXTI_Exti2_GetImr3();
  }
  else
  {
    return 0;
  }
}


void EXTI_SetImr(const EXTI_TypeDef *Instance, uint32_t u32Offset, uint32_t u32Value)
{
#ifdef EXTI1
  if (Instance == EXTI1)
  {
    EXTI_Exti1_SetImr(u32Offset, u32Value);
  }
#endif  /* EXTI1 */

#ifdef EXTI2
  if (Instance == EXTI2)
  {
    EXTI_Exti2_SetImr(u32Offset, u32Value);
  }
#endif  /* EXTI2 */

}

uint32_t  EXTI_GetImr(const EXTI_TypeDef *Instance, uint32_t u32Offset)
{
#ifdef EXTI1
  if (Instance == EXTI1)
  {
    return EXTI_Exti1_GetImr(u32Offset);
  }
#endif  /* EXTI1 */

#ifdef EXTI2
  if (Instance == EXTI2)
  {
    return EXTI_Exti2_GetImr(u32Offset);
  }
#endif  /* EXTI2 */

  return 0;

