zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_exti.c
}

void EXTI_SetEmr(const EXTI_TypeDef *Instance, uint32_t u32Offset, uint32_t u32Value)
{
#ifdef EXTI1
  if (Instance == EXTI1)
  {
    EXTI_Exti1_SetEmr(u32Offset, u32Value);
  }
#endif  /* EXTI1 */

#ifdef EXTI2
  if (Instance == EXTI2)
  {
    EXTI_Exti2_SetEmr(u32Offset, u32Value);
  }
#endif  /* EXTI2 */

}

uint32_t  EXTI_GetEmr(const EXTI_TypeDef *Instance, uint32_t u32Offset)
{
#ifdef EXTI1
  if (Instance == EXTI1)
  {
    return EXTI_Exti1_GetEmr(u32Offset);
  }
#endif  /* EXTI1 */

#ifdef EXTI2
  if (Instance == EXTI2)
  {
    return EXTI_Exti2_GetEmr(u32Offset);
  }
#endif  /* EXTI2 */

  return 0;
}


uint32_t  EXTI_CheckEmr(const EXTI_TypeDef *Instance, uint32_t u32Offset)
{
#ifdef EXTI1
  if (Instance == EXTI1)
  {
    return EXTI_Exti1_CheckEmr(u32Offset);
  }
#endif  /* EXTI1 */

#ifdef EXTI2
  if (Instance == EXTI2)
  {
    return EXTI_Exti2_CheckEmr(u32Offset);
  }
#endif  /* EXTI2 */

  return 0;

}

uint32_t EXTI_Exti1_GetRtsr(uint32_t u32Offset)
{
#if !defined(CORE_CM0PLUS)
  if (u32Offset == 0U)
  {
    return EXTI1->RTSR1;
  }
  else if (u32Offset == 1U)
  {
    return EXTI1->RTSR2;
  }
  else if (u32Offset == 2U)
  {
    return EXTI1->RTSR3;
  }
  else
  {
    return 0;
  }
#else   /* !defined(CORE_CM0PLUS) */
  UNUSED(u32Offset);
  return 0;
#endif  /* !defined(CORE_CM0PLUS) */
}

uint32_t EXTI_Exti2_GetRtsr(uint32_t u32Offset)
{
  if (u32Offset == 0U)
  {
    return EXTI2->RTSR1;
  }
  else if (u32Offset == 1U)
  {
    return EXTI2->RTSR2;
  }
  else if (u32Offset == 2U)
  {
    return EXTI2->RTSR3;
  }
  else
  {
    return 0;
  }
}


uint32_t  EXTI_GetRtsr(const EXTI_TypeDef *Instance, uint32_t u32Offset)
{
#ifdef EXTI1
  if (Instance == EXTI1)
  {
    return EXTI_Exti1_GetRtsr(u32Offset);
  }
#endif  /* EXTI1 */

#ifdef EXTI2
  if (Instance == EXTI2)
  {
    return EXTI_Exti2_GetRtsr(u32Offset);
  }
#endif  /* EXTI2 */

  return 0;
}


uint32_t EXTI_Exti1_GetFtsr(uint32_t u32Offset)
{
#if !defined(CORE_CM0PLUS)
  if (u32Offset == 0U)
  {
    return EXTI1->FTSR1;
  }
  else if (u32Offset == 1U)
  {
    return EXTI1->FTSR2;
  }
  else if (u32Offset == 2U)
  {
    return EXTI1->FTSR3;
  }
  else
  {
    return 0;
  }
#else   /* !defined(CORE_CM0PLUS) */
  UNUSED(u32Offset);
  return 0;
#endif  /* !defined(CORE_CM0PLUS) */
}

uint32_t EXTI_Exti2_GetFtsr(uint32_t u32Offset)
{
  if (u32Offset == 0U)
  {
    return EXTI2->FTSR1;
  }
  else if (u32Offset == 1U)
  {
    return EXTI2->FTSR2;
  }
  else if (u32Offset == 2U)
  {
    return EXTI2->FTSR3;
  }
  else
  {
    return 0;
  }
}


uint32_t  EXTI_GetFtsr(const EXTI_TypeDef *Instance, uint32_t u32Offset)
{
#ifdef EXTI1
  if (Instance == EXTI1)
  {
    return EXTI_Exti1_GetFtsr(u32Offset);
  }
#endif  /* EXTI1 */

#ifdef EXTI2
  if (Instance == EXTI2)
  {
    return EXTI_Exti2_GetFtsr(u32Offset);
  }
#endif  /* EXTI2 */

  return 0;
}


#endif /* HAL_EXTI_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
